{
  "basics": {
    "name": "Adrien Joly",
    "picture": "https://adrienjoly.com/img/photo.jpg",
    "email": "contact@adrienjoly.com",
    "website": "https://adrienjoly.com",
    "summary": "I help development teams produce useful, bug-free software for the long term.",
    "location": {
      "address": "129 avenue du Président Wilson",
      "postalCode": "93100",
      "city": "Montreuil / Paris, France",
      "countryCode": "FR"
    },
    "profiles": [
      {
        "network": "Github",
        "username": "adrienjoly",
        "url": "https://twitter.com/adrienjoly"
      },
      {
        "network": "Twitter",
        "username": "adrienjoly",
        "url": "https://twitter.com/adrienjoly"
      },
      {
        "network": "LinkedIn",
        "username": "adrienjoly",
        "url": "https://www.linkedin.com/in/adrienjoly"
      }
    ]
  },
  "work": [
    {
      "company": "Heal.dev",
      "position": "Software Engineer",
      "website": "https://heal.dev/",
      "startDate": "2023-10-01",
      "summary": "Heal.dev is an early stage startup which goal is to help companies detect and fix bugs on their web applications before they can impact end users, thanks to AI-based quality assurance (QA) agents running at scale. I have tackled a variety of challenging tasks on that innovative project with many unknown unknowns, involving LLMs on non-deterministic use cases.",
      "highlights": [
        "Lead the development and maintenance of a web agent that runs tasks expressed in natural language, on any website.",
        "Designed, integrated, tested, documented and maintained dozens of features involving LLM calls and diverse external APIs, in response to customer requirements.",
        "Developed internal tools to run automated tests on non-deterministic features and track regressions, to speed up the development process while reducing defects.",
        "Got rid of type errors in production by training the team on strict type-checking using TypeScript annotations in the JavaScript monorepo, without requiring transpilation."
      ]
    },
    {
      "company": "SHODO",
      "position": "Tech Coach",
      "website": "https://www.shodo.io/",
      "startDate": "2020-03-02",
      "endDate": "2023-09-29",
      "summary": "I joined SHODO to nurture my \"software craft\" skills with like-minded professionals and apply them during missions.",
      "highlights": [
        "Setup Continuous Integration, SQL Migrations, Continuous Improvement processes, Domain-Driven Design and Clean Code practices within the back-end development team of « Choose », an e-commerce startup company.",
        "Lead the refactoring and documentation of a TypeScript-based data integration pipeline for « Signaux Faibles », a startup helping companies prevent bankruptcy.",
        "Gave several conference talks and published articles, including \"Writing Automated Tests on a Legacy Node.js Back-End\" on InfoQ.com."
      ]
    },
    {
      "company": "Algolia",
      "position": "Senior Software Engineer / Tech Lead",
      "website": "https://www.algolia.com/products/crawler",
      "startDate": "2017-11-06",
      "endDate": "2020-01-31",
      "summary": "I lead the development and maintenance of Algolia’s Custom Crawler, a scalable distributed system built with Node.js and running on Google Kubernetes Engine.",
      "highlights": [
        "Turned a PoC into a robust product used by prestigious customers.",
        "Put up automated tests and production maintenance recipes.",
        "Trained team-mates to write atomic PRs, and sustainable code and tests.",
        "Gave talks about testing, pair programming and team communication.",
        "Wrote \"The Challenging Migration from Heroku to Google Kubernetes Engine\"."
      ]
    },
    {
      "company": "EEMI / ESGI / Web School Factory",
      "position": "Teacher",
      "website": "https://adrienjoly.com/teaching",
      "startDate": "2015-08-01",
      "highlights": [
        "Authored and gave a course on back-end / API programming with Node.js.",
        "Previously, I taught JavaScript programming to 12 groups of 1st-year students."
      ]
    },
    {
      "company": "Independant Product Maker",
      "position": "(Self-Employed)",
      "website": "https://adrienjoly.com",
      "startDate": "2015-10-01",
      "endDate": "2017-11-05",
      "highlights": [
        "Co-authored \"Startup Tour\", a 2-hour MOOC on the Lean Startup method.",
        "Developed and launched several products and browser extensions, including \"Next Step for Trello\" (5/5 rating, 30k+ users)",
        "Published my challenges and learnings regularly on Medium, YouTube and Twitch."
      ],
      "other": [
        "Developed a commercial student evaluation software with automatic code grading",
        "Produced and published several product demo videos on Youtube",
        "Broadcasted a dozen of public live coding sessions on Twitch"
      ]
    },
    {
      "company": "Freelance",
      "position": "Full-stack Node.js / Meteor / JavaScript web application developer",
      "startDate": "2015-03-01",
      "endDate": "2017-11-05",
      "summary": "I built full-stack web applications and data processing scripts. See my work on https://github.com/adrienjoly.",
      "highlights": [
        "Apr. 2015: Built a dashboard to visualize data from uploaded CSV files, for Deepki",
        "Jun. 2015: Helped a team build a marketplace, for FreelanceRepublik",
        "Jul. 2015: Wrote a script to convert data tables from PDF to CSV files, for Deepki",
        "Sep. 2015: Built a web app. to curate and promote hackathons, for BeMyApp",
        "2015-2016: Built a e-commerce website to rent designer clothes, for Panoply",
        "2015-2016: Coached the Agile development team of a startup company: Ayni",
        "Sep. 2016: Coached a young developer building Meteor.js apps, for Simplon.co",
        "Sep. 2017: Gave a 8-hour workshop on Lean Management, at ESGI"
      ]
    },
    {
      "company": "Whyd",
      "position": "Lead Software Engineer",
      "startDate": "2010-10-01",
      "endDate": "2015-02-01",
      "summary": "Lead developer of a B2C startup product, from its inception. The product peaked at 100000 users, after press releases on Techcrunch, Lifehacker, and Engadget.",
      "highlights": [
        "Discussed objectives with founders and proposed adequate technical solutions",
        "Lead 1 designer, 1 iOS developer (remote) and 1 web developer",
        "Developed the front-end and back-end, starting with Node.js v0.3",
        "Projected a large semantic graph into our production MongoDB database",
        "Open-sourced as \"Openwhyd\" after I left the company, in 2016."
      ]
    },
    {
      "company": "Alcatel-Lucent Bell Labs",
      "position": "PhD, Researcher in Context-Aware Social Networking",
      "startDate": "2007-09-01",
      "endDate": "2010-10-01",
      "summary": "(see \"Education\" section for more information about my PhD thesis)"
    },
    {
      "company": "Atos Origin",
      "position": "Mobile Software Engineer",
      "startDate": "2006-11-01",
      "endDate": "2007-08-01",
      "summary": "Consultant in the Mobile Devices team. (Pocket PC, Windows Mobile, J2ME)",
      "highlights": [
        "Developed a HTTP-SmartTP proxy to run on a SIM card, for Gemalto."
      ]
    },
    {
      "company": "Sauce Software",
      "position": "Freelance Software Developer",
      "startDate": "2005-12-01",
      "endDate": "2006-02-01",
      "highlights": [
        "Developed a Joomla module to synchronize users with cPanel and vTiger CRM"
      ]
    },
    {
      "company": "Intergraph Public Safety",
      "position": "Software Developer (intern)",
      "startDate": "2005-04-01",
      "endDate": "2005-06-01",
      "summary": "Dispatching software used by firefighters' HQ in the south of France.",
      "highlights": [
        "Extracted a DLL library from a monolithical C/C++ codebase."
      ]
    },
    {
      "company": "Isotools",
      "position": "Software Developer (intern)",
      "startDate": "2003-04-01",
      "endDate": "2004-08-31",
      "summary": "R&D project: integrate interative map-based charts in their CMS.",
      "highlights": [
        "Built a compiler in C++ to store vector data into Flash/SWF binaries."
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "Openwhyd.org",
      "position": "Open Source Lead Developer and Coordinator",
      "website": "https://openwhyd.org",
      "startDate": "2016-08-01",
      "summary": "After leading the development of the product formerly known as whyd.com during 3 years, I migrated its codebase into an open-source project. Today, I'm still maintaining it.",
      "highlights": [
        "Turned ex-startup product into an open-source project",
        "Migrated the service to better-adjusted production instance on DigitalOcean",
        "Launched a successful OpenCollective campaign to crowdfund hosting fees"
      ]
    },
    {
      "organization": "fHACKtory Hackathons",
      "position": "President, organiser, presenter",
      "website": "http://fhacktory.com/",
      "startDate": "2013-09-01",
      "endDate": "2015-02-01",
      "summary": "Organised 4 tech-focused hackathons in Paris and Lyon."
    },
    {
      "organization": "Angelhack Paris Hackathon",
      "position": "Ambassador, organiser, presenter",
      "startDate": "2013-01-01",
      "endDate": "2013-05-09",
      "summary": "Organised the 2nd edition of Angelhack Paris, at Cifacom, for ~100 participants."
    }
  ],
  "education": [
    {
      "institution": "INSA Lyon - Institut National des Sciences Appliquées de Lyon",
      "area": "Information Retrieval • Context Awareness",
      "studyType": "PhD",
      "startDate": "2007-09-01",
      "endDate": "2010-09-01",
      "summary": "CIFRE PhD thesis in partnership with Alcatel-Lucent Bell Labs France.",
      "highlights": [
        "Designed, prototyped and experimented a solution to match distant colleagues based on the similarity of the topics they are currently working on.",
        "Developed and deployed a Firefox extension + a matchmaking server.",
        "Published 7 papers in international conferences and journals. https://scholar.google.fr/citations?user=BI3HXcsAAAAJ",
        "Contributed to a ITEA2 European research project, and co-authored 3 patents"
      ]
    },
    {
      "institution": "INSA Lyon - Institut National des Sciences Appliquées de Lyon",
      "area": "Information Technology",
      "studyType": "MSc",
      "startDate": "2003-09-01",
      "endDate": "2006-09-01",
      "highlights": [
        "Final year at Queensland University of Technology, in Brisbane, Australia.",
        "Developed a PoC for Dr. Tjondronegoro, and co-authored 3 research publications."
      ]
    }
  ],
  "skills": [
    {
      "name": "Software Craft",
      "level": "Advanced",
      "keywords": [
        "TDD / BDD / DDD",
        "Pair / Mob programming",
        "Legacy Refactoring",
        "Clean Code / SOLID",
        "Hexagonal Architecture"
      ]
    },
    {
      "name": "Web Development",
      "level": "Master",
      "keywords": [
        "Node.js / Express / Fastify",
        "JavaScript / TypeScript",
        "React / Vue.js",
        "Git",
        "Go"
      ]
    },
    {
      "name": "Testing & CI",
      "level": "Master",
      "keywords": [
        "Jest / Ava / Mocha",
        "Cypress / Selenium / Cucumber",
        "GitHub Actions"
      ]
    },
    {
      "name": "DevOps & Maintenance",
      "level": "Advanced",
      "keywords": [
        "Docker",
        "Kubernetes",
        "Google Cloud Platform",
        "Terraform"
      ]
    }
  ],
  "languages": [
    {
      "language": "French",
      "fluency": "Native speaker"
    },
    {
      "language": "English",
      "fluency": "Fluent"
    }
  ],
  "interests": [
    {
      "name": "Plays drums",
      "keywords": [
        "Harissa (groove / jazz)",
        "Man Is Not A Bird (post-rock)",
        "Trapped by Stereo (post-hardcore)"
      ]
    }
  ],
  "references": [
    {
      "name": "Thibaut Gensollen – CTO, Choose",
      "reference": "Adrien est venu chez Choose pour: faire monter en compétences nos équipes, notamment sur les bonnes pratiques (craft), et la mise en place d’une roadmap permettant le refactoring d’un monolithe (codebase de 4 ans) sans CI/CD ni tests unitaires et avec des soucis de performances et de maintenabilité. Sa capacité à comprendre et à parfaitement mixer les besoins business, techniques et humains, a permit aujourd’hui à Choose d’avoir une codebase propre, stable et performante, sur laquelle n’importe quel nouveau développeur peut interagir rapidement. Nos développeurs sont aussi devenus très impliqués sur les notions Crafts, TDD ou DDD. Depuis son arrivée, [...] notre risque face au déploiement a été considérablement réduit. Je ne peux que recommander Adrien pour ce genre de problématiques."
    },
    {
      "name": "Pierre Camilleri – Data Scientist, Signaux Faibles / Banque de France",
      "reference": "Le travail d’Adrien est irréprochable, le code produit est de qualité et répond très exactement à l’objectif fixé. Adrien est ouvert d’esprit, créatif et la communication a été très fluide au sein de l’équipe. On remarque immédiatement qu’il est passionné par ce qu’il fait et son enthousiasme est communicatif. En somme, il m’a appris beaucoup de choses, j’ai pris un réel plaisir à travailler quotidiennement avec lui et j’espère que nous aurons de nouveau l’occasion de travailler ensemble."
    },
    {
      "name": "Anthony Hymes – Digital Marketing Manager, Whyd",
      "reference": "His thoroughness, ingenuity, and ability to respond rapidly to issues makes him an indispensable member of our team. But he is more than just a programmer, his business intuition and entrepreneurial spirit bode very well for whatever future projects he chooses to embark upon."
    },
    {
      "name": "Nasreddine Bouzada – Software Architect, Atos",
      "reference": "Reliable, pleasant, creative, passionate, strong technical/communication skills, tough on problem solving, end user satisfaction oriented. He managed to create an overall group cohesion in the team because of his constant good humor, never hesitating to lend a hand by sharing his knowledge with his colleagues. It has been a great pleasure working with Adrien."
    },
    {
      "name": "Johann Stan – Research Engineer / PhD Candidate, Alcatel-Lucent Bell Labs",
      "reference": "Adrien's capacity to ask the right questions, his motivation to define new scenarios that help people in their communication needs were key in the success of my Master thesis and the resulting publication. By having Adrien as a supervisor you have the certainty of fully enjoying each moment of your work."
    }
  ]
}
